{
    "version": "https://jsonfeed.org/version/1",
    "title": "SamHou's blog • All posts by \"english\" tag",
    "description": "SamHou 的一个博客，有技术文章，小说和生活学习方法分享。包含 C#、html、css、NAS、windows 的技术博客文章，以及大量二次创作小说和原创作品。",
    "home_page_url": "https://blog.samhou.top",
    "items": [
        {
            "id": "https://blog.samhou.top/ProjeTom%20--%20A%20story%20to%20test%20new%20words/",
            "url": "https://blog.samhou.top/ProjeTom%20--%20A%20story%20to%20test%20new%20words/",
            "title": "ProjeTom -- A story to test new words",
            "date_published": "2024-02-09T13:02:41.000Z",
            "content_html": "<h2 id=\"1\"><a href=\"#1\" class=\"headerlink\" title=\"1\"></a>1</h2><p>The man named Tom ran into the alley and kneeled down. 1 year ago,he tought about the prospect of his project which was about plantation… He think it will bring him considerable revenue and will make facilitation to the process of farming. However, for some reason, he has to speculate the value of this plan again now…</p>\n<h2 id=\"2\"><a href=\"#2\" class=\"headerlink\" title=\"2\"></a>2</h2><p>When the sensors detects that the plant is lack of water, the machine will atomatically water the stem. That’s Tom’s “AutoWater” project. Provided that it works well, the plants will grow 30% faster than normal. This figure comes from the lab where Tom developed the “AutoWater” machine and did experiments on it. He was at fever pitch that time and called the factory to produce 200 copies. Then he designed a great advertisement to sell them…</p>\n<h2 id=\"3\"><a href=\"#3\" class=\"headerlink\" title=\"3\"></a>3</h2><p>“Your firm farming ally - AutoWater Machine” Tom designed a short advertisement with a synopsis of his product. In 1 month, 100 machines were sold. He took a chance on providing free technological spport. This can avoid crippling effect on plants when the owner carelessly made a wrong setting. But after another 1 month, Tom started receiving complanation about the machine. Most plants which can be cut after 1 month didn’t grow faster. They grow as fast as the ones that were watered manually. Confused and sad, Tom went to the owners’ home. He put on the mitt and inspected the plants. There he found the problem. On real farm, the water pipes are placed on the ground, not in the soil. The water slaped on the plants, but little was absorbed by the plants. However, there was still one problem. He himself installed the machines and placed the pipes in the soil. Why they are out now?</p>\n<h2 id=\"4\"><a href=\"#4\" class=\"headerlink\" title=\"4\"></a>4</h2><p>He asked his customer to place a camera in the farm to figure out the reason. The customer agreed. Tom assured that he would find the reason in 5 days. By setting an alarm, he can see to the farm when something moves. At night, he was wakened by the alarm. 2 birds was trying to take the pipe out! They at first lied on the pipe, then managed to dig it out. Tom was shocked. The birds liked the pipes so much that they wanted to take them away! However, after some time, they became melancholy and flew away to the prairie. Still confused, he saved the video and decided to ask a biologist for help.</p>\n<h2 id=\"5\"><a href=\"#5\" class=\"headerlink\" title=\"5\"></a>5</h2><p>“Oh, that’s an interesting video… Birds like water pipe? Maybe the pipe itself has some attractive characteristcs? Could you please show me the pipe?” The ace biologist showed great interest in the video. On their way to the farm, Tom acquaint himself with the biologist, and told him more details about his project. “I think your ‘AutoWater’ project is also helpful in the lab. During some experiments, plants have to be watered properly.” “Maybe I can also make a machine that can be used in the lab.” Tom tought to himself. On the farm, the biologist touched the pipe. “It’s cool. The water inside absorbed the heat.” “Is this related to those ominous birds?” “I don’t know. Maybe there’s a relationship between these 2 things. By the way, how can birds dig out such heavy pipes?” “I’m not a physicist. I’m also confused.” “Oh, aubergine here.”Tom said,”I think they are just like the pipes. Does those birds eat aubergines?” “No, they don’t. They like little insects better. Look at those plants. They are not damaged.”</p>\n<h2 id=\"6\"><a href=\"#6\" class=\"headerlink\" title=\"6\"></a>6</h2><p>The biologist took out the video and watched it over. “Looks like there weren’t any insects on the pipe.” “So what is the real reason?” Tom asked. “I still have no idea. Maybe you can try to bury the pipes deeper?” Tom accepted this solution. He improved the architecture of AutoWater machine.(Though his patent hasn’t been modified because of the bureaucratic inefficiency.) “Now the ‘activists’ cannot take it out.” Tom thought to himself. He avoided the illicit places, such as public farms, when testing the new machine. He also updated the one on his customer’s farm, and recorded one more video.</p>\n<h2 id=\"7\"><a href=\"#7\" class=\"headerlink\" title=\"7\"></a>7</h2><p>In this new video, no birds stayed here. The pipes were invisible, and birds flew away to another place. “I guess the real reason is that they want to cool themselves down. Pipes full of water is so cool that birds like them very much and want to dig them out to enjoy the considerable heat absorption.” “I see. That’s such an eventful research. Now I have to confront the problem and apply the solution to all my customers.” said Tom,”However, I don’t have enough money to do so… I’ve got a loan, but it’s not enough to continue my project.”</p>\n<p>That’s what has happened since 1 year ago. Now Tom has to deal with such big problem that he doesn’t know what to do. He ran into the alley and kneeled down…</p>\n<h2 id=\"8\"><a href=\"#8\" class=\"headerlink\" title=\"8\"></a>8</h2><p>“Do you hear that?” “The intermittent crying?” “Yes! Let’s find out who is crying! “ 2 rich men with gown in the next building walked out and found Tom. “Poor man, what has happened to you? “ “They must be in contempt of me.” Tom thought to himself. “My project failed. I’ve got no money. I have no orientation of life. Leave me alone please.” “What is your project?” The 2 men asked. “It’s called AutoWater…” Tom explained intermittently. “Wow, that’s an interesting novelty. I think it’s better used in the lab.”One man said. “I can give you fund to continue developing, if your design is good enough.” The other man said. Tom took out his phone and showed the design paper. “Why not go to our home? It’s just a few steps away and we can discuss the design with a projector!” Said the men.</p>\n<h2 id=\"9\"><a href=\"#9\" class=\"headerlink\" title=\"9\"></a>9</h2><p>The man with gown opened the door and these 3 people came in. “The municipal lab need this.” The man said, “Oh, my name is Bob, and he is Joe.” “Nice to meet you, Bob and Joe. Let’s copy the design paper to this projector…” After some time, they successfully projected the paper on the wall. “Wow, amazing design! It’s so small and it’s easy to use.” Bob said. “The machine is controlled by a tiny computer. I specialized in computer programming in college. Let me show you the code.” “We don’t want to know the technical things… All we know is that your project is amazing and can make much profit if advertised and sold properly! “ Joe said. “So you have to adjust your design to fit into the lab environment. Don’t worry, we’ll provide you with fund to do this.” Bob said. “A great investment! “Joe agreed.</p>\n<h2 id=\"10\"><a href=\"#10\" class=\"headerlink\" title=\"10\"></a>10</h2><p>“Here is your new lab.” The next day, Joe and Bob provided a new lab for Tom. “Thanks! Here are all necessary things I need to develop.” “If something is absent, just use that telephone or the Internet to order some. Now we have to leave. I can’t put up with those boring machines anymore… We’ll go to invest some other projects! By the way, do not make piracy… You can search existed design with that computer. Be discreet and wish you good luck! “ The 2 men left. Tom made a comprehensive research and wrote part of his development report. When designing the shape of his machine, he added some ornamental. “What features should a machine that works in a lab need? I scarcely have any idea… Maybe I have to ask someone…? Oh, there’s such a great person to ask.”</p>\n<h2 id=\"11\"><a href=\"#11\" class=\"headerlink\" title=\"11\"></a>11</h2><p>“I’ve got fund support to continue my project.” Tom typed a message to the biologist, “Could I ask some questions about biology lab?” After some time, he got the reply. “Oh, that’s favourable help to your project.” “What about having a meeting tomorrow afternoon? I will come to visit you at 2 p.m..” “Wait a moment… OK, I’m available at 2p.m.. To tell you the truth, I’m a little dismal these days because of so much work to do… I think chatting with you is a great opportunity to relax.” “Believe in yourself! You are the best biologist in this country! You even figured out the truth of the mystery last time!” “That’s a good compliment. Thank you. See you tomorrow.”</p>\n<h2 id=\"12\"><a href=\"#12\" class=\"headerlink\" title=\"12\"></a>12</h2><p>The door bell rang. “Good afternoon, Tom.” “Tell me your question please. I’ll answer them as clearly as possible.” “OK. First I have to talk about my project…That’s all.” “Great idea. I’m looking forward to the machine.” “I’ll definitely send one to you after it is completed. Now I’ll show you the questions.This is the first question. How much free space can a lab have?…” The discussion last for 2 hours. Tom learned a lot about staggering biological lab. Some things that Tom thought was ornamental are pretty useful. “I must be abusive when I enter biological lab. The scientists may sequester me from any of the equipments…” Tom thought to himself. “I don’t have any questions now. Thank you! Maybe after just a few months you’ll see the machine…” However, what Tom didn’t know was that a thief broke into his development lab and stole the valuable design report. The police have been looking for the thief but didn’t hunt down him for 2 hours. Tom’s phone ran out of battery and didn’t received the call from the police…</p>\n<h2 id=\"13\"><a href=\"#13\" class=\"headerlink\" title=\"13\"></a>13</h2><p>When Tom returned to his lab at 5 p.m., he saw a group of policeman. He wondered what they are doing. “Hey, a thief just broke into this lab. You may come tomorrow if…” “Wait a moment. I’m Tom and now I’m the adminstrator and specialized researcher of this lab…” “You are Tom? Why you didn’t answer our phone call? We have no idea where you are, so we have to call Bob and Joe, as they are the owner of the lab. They told us to bring you a message.” Tom took out the phone and it has automatically turned off because of low battery.”I’m sorry. I forgot to charge it… So what’s the message?” “Don’t worry, the assurance will pay for everything lost before the police hunt down the thief.” “Oh, looks like the situation is not so bad.” “Em, we found something atomic energy in your lab which is illegal and harmful. Are you familiar with this?” The policeman showed a photo of a box. “I haven’t seen it before.” “The video record shows that the thief brought this in. We’ll figure out how much energy it have. You can get into the lab now. By the way, there are still some policeman doing research in the lab to find evidence to hunt down the thief. Take this ID card and they will recognise you with the QR code on it.”</p>\n<h2 id=\"14\"><a href=\"#14\" class=\"headerlink\" title=\"14\"></a>14</h2><p>“T…O…M… Oh, you are that aspiring young man. We’re sorry to tell you that your research paper was also stolen. Though we can recover the file from your computer, the thief may publish it before you do.” “What can I do now? Finish the project as quickly as I could and without revision?” “You certianly don’t have to worry. We have informed the organisations to approve patents about the theft. Anything similar to your AutoWater project will not get endorsement.” “Thanks. Can I continue using the lab today?” “Um, we are still collecting evidence. It’s about 6p.m. now. Maybe you can come here tomorrow. Remember, rest is as important as working. By the way, I think your project has bright prospect.”</p>\n<h2 id=\"15\"><a href=\"#15\" class=\"headerlink\" title=\"15\"></a>15</h2><p>In the next few months, Tom worked hard on his project to revise the machine design. Meanwhile, the thief was caught when he tried to publish the stolen design. On one afternoon, Tom was in the cafeteria, thinking about what he could do to make the machine more efficient. “Hey, nice to meet you Tom.” “Oh, nice to meet you, Jack.” Jack was the great biologist who provided help to Tom’s project. He knew his name at one meeting. “Does AutoWater ver.1.5.6-Alpha work well?” “It works, but there were still some prbloms. First, the water becomes steam when the temperature increases…” Tom wrote down the problems and tried hard to worked out a solution in the next few days. However, something unexpected happened…</p>\n<h2 id=\"16\"><a href=\"#16\" class=\"headerlink\" title=\"16\"></a>16</h2><p>“…I like your AutoWater project. You are a men with marvellous imagination and creativity. What about designing a new product? We can surely pay huge amout of money for the design and function. Here’s the depiction of our product…If you deem our product valuable, just reply this email… Yours sincerely, Matt form NeuroAI.” An email appeared in Tom’s inbox. “The ‘steward’ of NeuroAI? Designing the shape, writing code and training AI models sound interesting…” “Hello Tom! How is the project going?” Joe and Bob came in. “Um, I solved some problems these days. AutoWater ver.1.5.7-alpha will be available in 3 days. I think it can be finished in a week. By the way, I received this email today. I think I may go to NeuralAI after finishing the AutoWater project.” “NeuralAI? That’s a big company. The murderous employers may try to force you to overwork. Oh, you can make a new project after you resign! We’ll surely provide fund again if your idea is great! But now, focus on the project here. We’re going to sell products and make money! Some contracts are necessary. Don’t worry, we will only take 10% of your project’s profit. The rest is yours!”</p>\n<h2 id=\"17\"><a href=\"#17\" class=\"headerlink\" title=\"17\"></a>17</h2><p>2 weeks passed away quickly. Tom enjoyed the time improving such a project. 1 day after the first release, he had already received 100 orders from lab all over the world. “The estimated profit is $1,000 per lab. So you will receive about $90,000 for now… But I think it’s still too little. I’m sure it can reach 1000 orders soon.” “Are you serious? Receiving $900,000 for such design is a sheer dream.” “It’s not a decisive point now. A product often reach top sales in 5 days. My intuitive sense told me to wait.” “Um, although you are not the legislative designer of the market, I decide to believe you.” Tom said.</p>\n<h2 id=\"18\"><a href=\"#18\" class=\"headerlink\" title=\"18\"></a>18</h2><p>“Wow, amazing number. Tom, your machine is a great success!” “$20,000!? Does such a design worth $20,000!?” “A good designer will never be short of money when he has already get fund to design. So now do you still want to go to NeuroAI?” “No, I’ve changed my idea. I will design things all by myself. My next project is… An AI robot used for talking with old people when there children are not around!” “Tom, you are really a man with marvellous ideas. You’ll still be out parter, right? Just focus on your design, and we’ll do the rest. Like the last time, we’ll still take 10% of your profit.” “Of course I will. But this time, I want to make the code of my project open-source.” “Wait a moment. Open source projects are free for use, even for financial purpose… I think keep the code a secret is a better idea to protect your project.” “It’s not a sheer money problem. It’s related to the spirit of open source programmers.” “Sorry, can you explain that?” “Programmers share their code online,receive positive reviews, discuss about ‘pull requests’, which are edits of code by another programmer, and make cool projects available for everyone.That’s to say,the code is free-to-use and written by many people. The creator of the project not only build the project, but examine other’s code as well, so the quality of the project is grarantted. But the most important point is that, I want everyone to be able to build one robot at home, even they have no money to buy my product.”</p>\n<h2 id=\"19\"><a href=\"#19\" class=\"headerlink\" title=\"19\"></a>19</h2><p>“Although we don’t think it’s a good idea, we are also moved by your explanation.” Joe said. “Yes, we’ll always stay with you. What a talented programmer!” Bob agreeed.</p>\n<p>“I’ll give the new product a name – ERobot, with means a robot which is easy-to-use and easy-to-build.” “Great idea! You can start building now, right?” “Of course…”</p>\n<p>Tom still has a long way to go. The advent of newer technology is also useful. He may build a great robot, or failed and run out of money. Who knows? There are so many possible endings, but with the cord of friendship with Joe and Bob, his life may become easier…</p>\n<p>(The end)</p>\n<h2 id=\"20\"><a href=\"#20\" class=\"headerlink\" title=\"20\"></a>20</h2><p>After Story:</p>\n<p>19 is already the end of the story,so 20 is not part of the story itself, but the reason why I wrote such a story. At first, I just wanted to write a few sentences to test new words. However, I think that’s too boring, so I started to write a story – a story about a young man pursuing his goal. I wanted to make it as interesing as possible, so I tried to add some suspense and more characters. I know till the end, the story is still not interesting enough… But for me, it’s a great success. It is not because how good the story itself is. I wrote it, and enjoyed myself writing it, that’s enough.</p>\n<p><em>About the company NeuralAI in the story: To tell you the truth, I got the inspiration from the name of my favourite AI Vtuber @Neurosama.</em></p>\n",
            "tags": [
                "小说",
                "English"
            ]
        }
    ]
}